Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.GetModelObjectIdentifiers Method
 Gets model object identifiers of the drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<Identifier> GetModelObjectIdentifiers(
	Drawing drawing
)
Public Function GetModelObjectIdentifiers (
	drawing As Drawing
) As List(Of Identifier)
Parameters
drawing
Type: Tekla.Structures.Drawing.Drawing
The drawing where objects are fetched.
Return Value
Type: List<Identifier>
List of model object identifiers in the drawing.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace